package diff

import (
	"strings"
	"testing"

	"github.com/sergi/go-diff/diffmatchpatch"
)

func TestDiff2(t *testing.T) {
	dmp := diffmatchpatch.New()

	origin := "被竹马甩了后，我勾上了自己的糙汉保镖。\\n因为他腰细肩宽大长腿。\\n我调戏他。\\n【每个月的加班时间能不能都用在晚上？】擅长口技，且服务意识强。\\n【我暗示的这么明显，你怎么不上道呢。】\\n晚上，保镖吻去我细碎的喘息，笑着朝我的耳边吹气。\\n【怎么样？大小姐，我够上道吗?】终于在几个月后，我死遁逃跑。\\n再见面，他用嘴撕开包装。\\n【不，不用这个了，谢知宁，进去的话，是不是就没办法逃跑了？】\\n一\\n深夜，破旧的出租屋里，我坐在地上，抽抽噎噎地擦眼泪。\\n陆令野沉默着递给我一个面包跟一瓶水。\\n我红着眼睛把水递还给他，可怜巴巴地看着他。\\n他皱了下眉。\\n「谢知宁，这么娇气，恩？」\\n话是这么说，他还是去洗了手，帮我拧开了瓶盖。\\n我确实渴了，一边抽抽噎噎一边小口小口喝水。\\n陆令野沉默了一下。\\n「我去洗澡。」\\n他拎着衣服走进了浴室。\\n大概是察觉到了我的意图，脑子里的系统发出警告声。\\n「宿主，你这样的话，会出事！你会死！你的攻略目标是你的竹马吴驰！」\\n系统的尖叫声无比刺耳。\\n一个小时前。\\n陆令野作为我的保镖，送我去一个晚会。\\n黑色背心遮不住鼓鼓囊囊的胸肌，小麦色的皮肤裸露在外，看的人血脉喷张。\\n他斜靠在车上不知道在想什么，目光散漫随性。\\n不过几分钟的功夫，已经有好几个入场的贵妇盯着他了。\\n「那是哪家小姐的宠物？」\\n「那公狗腰看得我好馋。」\\n「你真是……不过这是谁家死丫头吃的这么好，咱们去把他要过来玩几天。」\\n「一起吗？他肯定游刃有余。」\\n窃窃私语混着笑声传来，我有点莫名的怒火。\\n「反正也没有三个月好活了，我就要及时行乐。我就不能醉一回吗？」\\n我快死了，还有三个月。\\n十岁那年，我的脑子里出现了一个系统。\\n在它出现之后，我莫名其妙爱上了本来不在意的竹马吴驰。\\n它让我去攻略吴驰，获得他的喜爱值，结果这么多年，喜爱值一点没增。\\n直到昨天我才知道原因。\\n我只是一本书里的女二，真正的女主已经出现，我这个女二将在三个月后为男女主让道，突然身亡。\\n我的人生变成了一个笑话。\\n系统自知理亏，不再干扰我的心动。\\n于是在清醒过来的那一瞬间，我看着保镖陆令野，红了脸。\\n我要得到他！\\n我果断选择跃入水中。\\n周围响起惊呼的瞬间，一个矫健的身影游了过来。\\n而我所做的，是贴了上去，肆无忌惮地吻上他的嘴唇。\\n柔若无骨的手在他的身上肆意点火，很快摸到了那个让一群贵妇讨论的所在。\\n感觉到它叫嚣着想冲出牢笼的时候，我满意地笑了。\\n二\\n我当然不会告诉陆令野，我是为了占他便宜才跳下去的。\\n就像我不会告诉他，我从小熟识水性一样。\\n我把这件事全部推到了吴驰的身上，把自己伪装成一个失恋者，哭的梨花带雨，让陆令野带我回家。\\n他是不会拒绝的。\\n门的隔音并不好，水声传来，我都可以想象到，水滴顺着性感的锁骨一路而下，路过人鱼线，流向隐秘之处。\\n我摇了摇脑袋。\\n系统还在疯狂叫嚣，指责我的举动。\\n陆令野刚好在这个时候推门出来。\\n他没有穿上衣，只随便围了一条浴巾。\\n我看着他劲瘦有力的腰，想起白天那些贵妇的话，我的脸红到了耳朵根。\\n系统发出了一声花痴的尖叫。\\n这声尖叫成功地点燃了我。\\n我走上前去，鼓起勇气，伸手摸上了我白天打量的地方。那对鼓鼓囊囊的胸肌。\\n手感真是。\\n太棒了！真好。\\n怪不得我朋友经常去会所一掷千金。\\n吃的真好。\\n陆令野显然对我大胆的举动有些震惊。\\n不过也只是一瞬间。\\n他挑了挑眉，随性地靠在桌子边，任由我的手一路向下。\\n「怎么，大小姐，被欺负了就要占我的便宜？」\\n他不说还好，一说我的眼睛就红了。\\n我恶狠狠地抬头盯着他。\\n「就占你便宜，不行吗？」\\n女孩儿大概以为自己很凶，很有威慑力，殊不知落在别人的眼里，简直是像一只张牙舞爪的小兔子。\\n陆令野的喉咙里发出了一声愉悦的低笑。\\n「占便宜，当然可以。」\\n他凑近我，滚烫的气息打在我的耳后，烫的我一哆嗦。\\n带着薄茧的手覆上我的，来到蛰伏处。\\n「不过，大小姐，怎么这么笨笨的呢？」\\n「占便宜应该是这么占的才对。」\\n室内的温度节节攀升，烫的我腰软。\\n迷迷糊糊之间，我觉得自己软成了一滩水。\\n陆令野的手隔在我的腰跟桌子之间，看着我泪眼朦胧，小声求饶跟他说。\\n「站不住了……」\\n他单只手把我抱了起来，放在了桌子上。\\n脑子里的系统已经震惊地只会尖叫了。\\n温度攀升到最高点时，陆令野及时醒过来。\\n我不知道他突然停下的原因，只知道自己不知名的难受，这难受逼得我眼泪都快出来了。\\n我小声地喊他的名字。\\n我觉得现在的他像一把崩到极致的弓。\\n我的腿缠在他的腰上，有点委屈。\\n难道是我没有诱惑力吗？\\n他为什么这个时候还要停？\\n还是他觉得我喜欢吴驰，不想碰我？\\n我越想越委屈，几乎想马上抽身离开。\\n三\\n「陆令野，你是不是男人，这个时候你还能停……」\\n我委屈极了。\\n「你不感兴趣就算了，我去找别人。」\\n刚转头就被拉进了一个炙热的怀抱。\\n男人强有力的心跳声回响在耳边，喘息声听得我脸发烫。\\n「谢知宁，对自己要自信。」\\n他喘息着，带着我的手摸去摸向胯下，巨物不再蛰伏，规格大的让我心惊。\\n被情欲冲昏的脑袋瞬间清醒，我突然有点怂了。\\n「不能在这里，这里环境太差了。」\\n陆令野吻去我脸上的泪水，带着薄茧的大手一路向下。\\n手指宛若灵活的蛇，潜入花丛中，曲径通幽处。\\n我被烫的一抖，仰着脖子，一声喟叹。\\n「公主……」\\n「今天晚上，我只要你舒服。」\\n我是被电话吵醒的。\\n电话那头的吴驰开门见山，滔滔不绝讲了五分钟。\\n但是我太困了，一句没听懂。\\n系统恨铁不成钢，出来帮我总结。\\n但是由于昨晚吃瓜吃的太震惊，一晚上都在尖叫，它现在开嗓都有点哑。\\n「他说，他要跟你退婚，跟女主结婚。」\\n我「喔」了一声，从床上坐起来。\\n陆令野一大早就去工地了，给我留了纸条。\\n「早饭在锅里，吃完不准乱跑，等我回来。」\\n大概怕我不听劝，他在后面又加了一句。\\n「这边很乱，乱跑的话会被坏人抓走。」\\n我笑出了声。\\n手机那边的吴驰还在说话，听到我笑，声音一停。\\n「谢知宁，你笑什么？」\\n我懒得理他，挂断了电话。\\n四\\n外面晾着的床单昭示着我们昨晚的疯狂。\\n心情好，系统的公鸭嗓听起来都分外悦耳。\\n「第一次看到这么有服务意识的男主，遇到这种的，你就嫁了吧。」\\n见我不搭理它，它死心不改，继续八卦。\\n「昨天他在浴室里待了快四十分钟唉，那如果真枪实战，你扛得住吗？」\\n「……」\\n不知为什么，陆令野今天回来得格外的早。\\n这次从浴室出来，他连浴巾都没围。\\n我只看了一眼，像被烫到了一样，赶紧转了过去。\\n系统尖叫一声。\\n真是为难它了，嗓子都这样了，还能叫成女高音。\\n不对啊谢知宁，这是想这个的时候吗？\\n「这个 size！谢知宁啊啊啊啊啊啊啊，我跟你说的你都记住了吧！」\\n「死丫头吃的真好，我都要嫉妒你了。」\\n系统贱兮兮的声音回响。\\n下午在等陆令野的时候，它偷偷给我传授了很多秘籍。\\n但是我现在一紧张，忘光了。\\n我欲哭无泪。\\n书到用时方恨少。\\n我平时应该多读点书的。\\n不知道是谁先动的，等我回过神时，人已经身在酒店了。\\n前台小姐姐用吃瓜的眼神看了我们一眼，贼笑着开了一家房。\\n等看到房间里那间水床时，我惊讶地看了陆令野一眼。\\n这下轮到他脸红了。\\n说话都有些语无伦次了。\\n「不是，我开的不是这种，我去换一间。」\\n还换什么！\\n我伸手拉下他的背心，踮着脚吻了上去。\\n我们从门口吻到了浴缸。\\n房间的温度升到最高点时，我的背抵在冰凉的大理石上，身前滚烫是滚烫的小麦色肉体，劲瘦的耸动的腰让我想起了那几个贵妇的话。\\n不愧是有经验的。\\n看人真准。\\n……\\n第二天早上又是电话叫醒的我。\\n我不耐烦地摁掉电话，往陆令野的怀里缩了缩。\\n电话声锲而不舍。\\n我刚想发火，一只大手把我拿过电话，接通了放在我的耳边。\\n我对着那只手，奖励式地亲了一口，才对着电话「喂」了一声。\\n电话那头的声音熟悉又惹人烦。\\n「谢知宁。」\\n吴驰的语气很暴躁。\\n「你他妈人在哪儿？你敢跟野男人去开房！还是我家的酒店！你是故意的吗！」\\n放在我腰间的手动了一下。\\n女孩儿亮晶晶的眼神看着自己，像是挑衅。\\n「是那个？吴家的那个少爷？还是你那个打游戏的朋友？」\\n陆令野若有所思地看了我一眼。\\n我心虚地缩了缩脖子。\\n轻声跟他解释。\\n「吴家那个少爷是我好朋友，打游戏的那个是我资助的，这是投资，投资而已。」\\n陆令野挑了挑眉，不急不慢地「喔」了一声。\\n「你在跟谁说话？你真的养了野男人是不是！」\\n吴驰咆哮。\\n陆令野贴心地帮我把手机拿远了点。\\n我不理解吴驰破防什么。\\n在我的生日宴上拉着女朋友官宣的是他，漫不经心地跟别人说我只是他的舔狗的也是他。\\n可我眼下无暇顾及他。\\n只因身后顶着我的巨物。\\n陆令野起身把我抱了起来。\\n手机差点拿不稳，我惊呼一声。\\n我这才发现房间的抽屉里竟然藏着这么多莫名其妙的东西。\\n陆令野一只手抱着我，一只手在抽屉里翻找。\\n在看到那只皮质手铐时，我腿有点软。\\n吴驰还在嗷嗷咆哮。\\n陆令野用嘴撕开了包装，打开了手铐。\\n「咔哒」一声。\\n预想之中的触感没有传来。\\n陆令野拷上了自己的手。\\n「想要吗，谢知宁。」\\n「想要的自己争取。」\\n五\\n三天后。\\n一打开手机，铺天盖地的消息冲了进来。\\n第一个就是吴驰的电话。\\n陆令野正在帮我穿鞋，手上的薄茧蹭到我的脚心，有些痒。\\n「我说谢知宁，外面找你都快找疯了你知道吗，跟野男人厮混起来就不知廉耻了？」\\n他的声音有点冷。\\n「我要退婚约，你最好现在就滚回来，我在你家。」\\n陆令野手上的动作顿了一下。\\n我没注意到，他的眼神有点冷。\\n觉醒后我才发现，我身边的一切都是为了吴驰跟女主李梦如服务的。\\n我的父母像中邪了一样，他们看重吴驰更甚于我这个亲生女儿，甚至把李梦如当女儿一样养着。\\n是以他们知道我跟陆令野的事时，第一反应就是暴怒。\\n母亲更是怒不可遏地甩了我一巴掌。\\n李梦如惊呼一声。\\n「伯母，您别生气，姐姐肯定也不是故意的。」\\n楚楚可怜的眼神看向我，说出来的话看似为我开脱，实则句句都把我定在耻辱柱上。\\n「姐姐一定是因为我跟吴驰哥哥的事，伤心过度才会做出这种傻事的。」\\n「不过姐姐，再伤心也不能作践自己啊。」\\n「如如，你别劝我！我就当没有这个女儿！」\\n「败坏家风的东西！」\\n怒斥声，叫骂声，混合着劝架声。\\n逼得我无所遁形。\\n吴驰在旁边站着，冷漠地看着我，不发一语。\\n我只觉得天旋地转。\\n良久，鼻尖一热。\\n我摸到了一手血。\\n我是在医院的病床上醒来的。\\n陆令野趴在我床边，留给我一个寸头。\\n我突然想到了腿上的触感，脸一红。\\n大概是感觉到了我的视线，陆令野醒来。\\n不知道他这个姿势维持了多久，他的脸上压出了红色的印子。\\n还没有等他开口。\\n我笑着看着他。\\n眼泪不自觉滑落。\\n「陆令野，我没有家了，你能收养我吗？」\\n六\\n我不知道我的父母是什么时候改变的。\\n记忆里，他们一直把吴驰视作亲儿子，从小到大，如果我惹吴驰生气，他们就会怒不可遏。\\n我一直以为他们喜欢的是吴驰的家产，吴驰能带来的财富。\\n我现在才知道。\\n他们只是不喜欢我。\\n女主出现不过一月，就已经住进我家，得到了我的一切。\\n而我，只是因为不再按照剧情走，就会得到所有人的憎恶。\\n直到三个月后被抹杀。\\n系统显然比我还要低落。\\n它安慰我。\\n「没事的，谢知宁。」\\n它也词穷了。\\n喜爱值不够，我攻略不下吴驰，寿命就会一天天耗尽。\\n而我们都没有办法。\\n吴驰找到我时，我正学着陆令野的样子，把衣服丢进洗衣机里。\\n娇生惯养惯了，我很不习惯做家务，显得很是手忙脚乱。\\n李梦如的得意溢于言表。\\n「宁宁，只要你回去认个错，爸爸妈妈会原谅你的。」\\n爸爸妈妈？\\n我愣了一下，她惊呼一声，娇俏地捂住嘴。\\n「对不起啊宁宁，他们认了我当干女儿，我想过段时间再告诉你的。」\\n系统都听不下去了。\\n「嘴真欠，得了便宜还卖乖。」\\n我没说话，只是按下按键。\\n「没有父母的话，可以去拼一个。」\\n陆令野淡漠的声音从身后传来。\\n「不要去抢别人的父母。」\\n李梦如漂亮的小脸气成了猪肝红。\\n吴驰皱着眉头看着我。\\n「谢知宁，如果只是为了气我，没必要这么糟践你自己。」\\n「你这样跟一个婊子有什么区别？」\\n他的话还没说完，已经被一拳头撂翻在地。\\n我这才发现陆令野不只是在某些方面比较猛。\\n清脆的鼻骨断裂声传来。\\n陆令野漫不经心地点了一根烟。\\n转身按在了吴驰的身上。\\n七\\n我被叫回了谢家。\\n陆令野等在楼下，再三确认。\\n「真的不让我跟你进去？」\\n我假装轻松地拍拍他。\\n「你要是进去他们肯定更生气，放心吧，他们总归是我的亲生父母，不会把我怎么样的。」\\n跟上次的勃然大怒不同，父母看我的眼神冷漠的好像在看陌生人。\\n母亲把一份协议书推到我的面前。\\n「签了吧。」\\n协议很长，生怕我跟李梦如分财产，上面把一切都规划的清清楚楚。\\n给我三百万。\\n前提是我需要断绝跟谢家的关系，除了还姓谢，其他的一切都得跟谢家断的干干净净。\\n有人上上下下，我看得分明，他们手里抱着的是我的东西。\\n我从小到大的照片，我的奖杯，我画的画，都被收拾出来，扔了出去。\\n见我盯着他们的动作，母亲突然有些不自在。\\n她干咳了一声。\\n「反正你也不在谢家住了，那些东西梦如看着难受，索性就扔了。」\\n「如果你要的话……」\\n父亲强硬的声音打断了她的话。\\n「还要干什么？以后拿着这些来认祖归宗，跟梦如分家产吗？」\\n他指着我，病态地颤抖。\\n「生养你这样的女儿，简直是我一辈子的耻辱！」\\n「要不是有梦如，我早就被你气死了！」\\n李梦如在旁边，乖巧地给他拍背，善解人意的样子谁看了都喜欢。\\n「姐姐，你不要再气爸爸了，他为了你的事，已经很操劳了。」\\n「梦如，别再跟她叫姐姐，她从今天开始，跟我们谢家一点关系都没有！」\\n我看着他们把那张全家福拿下来，换上了他们跟李梦如一起拍的全家福。\\n不再犹豫，我干脆利落地签上了自己的名字。\\n接过协议的那一刻，母亲的眼里闪烁着泪花。\\n但是随即，像是被什么控制住，她的眼神重归冷漠。\\n「签好了的话，你就走吧。」\\n「看在我们的面子上，吴驰那孩子才没有找那个野男人的麻烦，只不过如果再有下次，我们不会放过他。」\\n她犹豫了一下，最后看了我一眼。\\n「你以后，自重保重吧。」\\n八\\n陆令野等在楼下，他看向我，眼里都是关切。\\n我挤出了一个比哭还难看的笑。\\n「陆令野，一切都快结束了。」\\n落入温暖的怀抱，我终于落到了实处，嚎啕大哭。\\n明明一个月前，还是父母疼爱的大小姐，有未婚夫，有美好的生活。\\n可是女主出现了，我这个女二在阳光下，只能现出了原形。\\n「什么都是她的，爸爸妈妈是她的，男主是她的，连命马上也没了。」\\n陆令野身体一僵。\\n「什么？」\\n我意识到说漏了嘴，揪着他的衣服擦眼泪，他又好气又好笑。\\n「陆令野，你会永远是我的吗？」\\n他吻掉我的眼泪。\\n「会，永远都会。谁都没办法从你身边抢走我。我自己都不行。」\\n我哭的更大声了。\\n泪眼朦胧中，我看到李梦如的身影。\\n还有她嫉妒到恐怖的眼神。\\n我跟陆令野去旅行了。\\n拿着那三百万。\\n不得不承认，自己出去玩儿跟身边有男朋友是不一样的，特别是很有服务意识的男朋友。\\n我穿着比基尼，开心地踩沙子。\\n有不少人过来搭讪，但是看到我身后穿着沙滩裤，裸着上半身的陆令野，马上表明自己只是来借个火。\\n我抢过陆令野的墨镜戴在自己的脸上。\\n「都怪你，坏了我多少桃花！」\\n后者无奈摊手。\\n「那怎么办，大小姐，我以身抵债好不好？」\\n「不好！」\\n我指着他的沙滩裤。\\n「不准穿的这么勾人！」\\n这一会儿我看到好几个女孩子往这边看了！\\n陆令野商量的语气。\\n「那我明天出来的时候，穿羽绒服？」\\n我思考了一下。\\n「行。」\\n接过他递过来的椰子汁，我小声问。\\n「我穿比基尼，你会吃醋吗？」\\n「有一点。」\\n「那你干嘛不阻止我？」\\n陆令野帮我涂防晒的手一顿。\\n「我在你旁边呢，想穿什么就穿。」\\n我无声地笑了。\\n可是陆令野，你不能保护我一辈子啊。\\n我马上就要被抹杀了。\\n抹杀的时间越来越近，我常常说话说着说着，鼻血就流下来。\\n第一次这样是在我们接吻的时候，刚到房间，陆令野刚脱上衣，两道鼻血飞流而下。\\n他惊讶地挑眉。\\n「我的魅力这么大吗？」\\n这种情况越来越频繁，他意识到了不对劲，要带我去看医生，被我拒绝了。\\n医生是治不好的。\\n剩下的时间里我只想一直跟他待在一起。\\n我们旅行的最后一天，两个人都默契地选择不出门，待在房间里。\\n没有做任何事情，只是安静地待在一起。\\n最开始只是单纯地为了反抗自己作为女二的命运找上的他，没想到最后，唯一一个对抗情节站在我身边的人，是他。\\n还有一个不是人，系统。\\n「那你呢？你为什么喜欢我？」\\n陆令野没有搭话。\\n我看到他的脸红到了耳朵根。\\n「不说就算了，看你这么纯情。」\\n我装作沉沉睡去，朦胧之中，感觉到自己的手指被套上了一枚戒指。\\n他似乎是在确认尺寸，确认无误后想小心翼翼取下来。\\n我却不愿意成全他，装作沉睡中，翻了个身，把戒指压在了身下。\\n大概是怕吵醒我，陆令野轻轻亲了我一下，下床去打电话。\\n我听到了「订花」「气球」之类的词。\\n两行清泪没入枕头中。\\n九\\n我把剩下的钱给了陆令野，找了个安静的地方等死。\\n每天沉睡的时间越来越长，醒来的时候天都黑了。我习惯性的去摸身边，却再也没有摸到熟悉的温度。\\n旁边是冷的，我的心也是冷的。\\n我的反应越来越迟钝。有时候系统跟我说话我都要反应很久。\\n「对不起啊，我是个没用的宿主，害得你和我一起被抹杀了。」\\n系统的声音带上哭腔。\\n「我也是个没用的系统，好不容易找到一个十八禁男主，你还是得死。」\\n一人一统哭成狗。\\n我让系统去打听陆令野的消息，但是它也越来越虚弱，刚开始还能放点朦胧的片段，后面却越来越少，最后连声音都没了。\\n那天早上醒来后他是准备求婚的，发现我不见了的那一瞬间，他还以为我在跟他开玩笑。\\n直到他发现我真的不见了。\\n一路跌跌撞撞冲下去调监控，到处找我，大街小巷贴告示。\\n他甚至走投无路，去求了谢家。\\n我看到他跪在谢家门口求他们动用人脉帮忙，却被告知，谢家跟我不再有任何关系。\\n片段停在了这里。\\n我也再次昏睡了过去。\\n我在系统的哭声中醒来。\\n人在死之前是能感觉到自己的大限将至的，我躺在床上，看着电视上直播吴驰跟李梦如的婚礼。\\n父亲母亲坐在上位，作为李梦如的父母出席，眼神无比欣慰。\\n我终于要死了。\\n在我手脚冰凉的那一瞬间，电视上的夫人，流下了一行眼泪。\\n不知道为什么她突然想到了自己那个不争气的女儿。\\n可能是梦如找到了自己的幸福，太激动了吧。\\n她想。\\n十\\n三年后。\\n我在系统惊喜的叫声中惊醒。\\n我没想到自己还能再醒来，系统扫描我的健康情况，惊讶的发现一切指标竟然恢复了正常。\\n三年没吃没喝，我竟然没死！\\n我痛哭流涕，第一件事就是奔到面馆里，要了三碗牛肉面。\\n我竖起三根手指。\\n老板挑眉。\\n「加三个鸡蛋？」\\n「不，每碗加三份牛肉。」\\n老板的脸色瞬间石化。\\n我听到他跟老板娘嘀咕。\\n「没吃过饭似的。」\\n我一边大口吃面，一边听店里电视上的娱乐新闻。\\n「你醒了第一件事，竟然不是去找陆令野？」\\n「我得先吃饭吧，我要饿死了。」\\n新闻上正在放最近的一对明星夫妻闹离婚。主持人八卦完之后，紧接着播放了另外一个新闻。\\n我听到了熟悉的名字。\\n「知名女星李梦如近日与丈夫吴总闹离婚，其原因竟是多年出轨！」\\n「据悉，李梦如出轨对象是大亨陆令野！」\\n咣当。\\n我的筷子应声掉地。\\n在老板鄙视的眼神中，我硬着头皮问他，能不能洗碗抵债。\\n或者是先欠着，等我找到人就来给他钱。\\n为了证明我话的可信度，我指着身后电视上的陆令野的镜头。\\n这厮现在混的特别好，据说是开了一个公司，还当了什么协会会长，三天两头上电视，生怕别人认不出他似的。\\n「这个人看见了吧？他最开始开公司的本金还是我给的！」\\n「等我找到他，让他翻五倍给你！十倍都行！」\\n我言辞恳切，感情激动，生怕老板以为我是个骗子，来吃霸王餐。\\n老板显然是一个好心人，他点了点头，表示他相信我。\\n「你跟这位陆总什么关系啊？」\\n我有点不好意思。\\n「我两以前谈恋爱来着。」\\n老板跟老板娘对视了一眼。\\n「行，你走吧，我相信你，你看着也不是那骗钱的人。」\\n果然这世界上还是好人多啊。\\n我流泪出了门，发誓等我找到陆令野，一定让他把这个店买下来，感谢老板老板娘的善良。\\n结果我人刚跨出门，就听到两人背后蛐蛐我。\\n「一看就脑子不好使，大冬天穿个裙子，还破破烂烂的。」\\n「算了，得罪疯子太可怕了，就当积德行善了。」\\n我。\\n「……」\\n等我找到陆令野，我还是会让他把店买下来。\\n让他们四眼看人坏！\\n十一\\n陆令野的公司简直不要太好找。\\n我带着系统找到他公司的前台，敲了敲桌子。\\n「你好，我找陆令野。」\\n前台小姑娘愣了一下。\\n「啥？」\\n我耐心地重复了一遍。\\n前台小姑娘的态度不错，让我坐下来等。\\n我刚坐下来就听到她给保卫处打电话。\\n好歹也是前谢家大小姐，现在到处被当成疯子。\\n我也是有骨气的，转头就走。\\n不让我在里面等，我在外面等不就行了？\\n我蹲在门口石狮子那里，冻得瑟瑟发抖，旁边保安大哥看了我好几眼，终于叹了口气，把他的军大衣扔给了我。\\n我带着哭腔。\\n「大哥，你真好。」\\n终于遇到一个不把我当疯子的人了！\\n大哥摆摆手，两坨高原红不知道是冻得还是怎么，红到了耳朵根，让他看上去异常朴实。\\n「小事儿，你再蹲一会儿就去找你家人，让他们带你去看病吧。」\\n「老是这么拖着也不是个事儿。」\\n「……」\\n肤浅。\\n我一边等，一边跟系统聊天。\\n「你觉得陆令野还会理你吗？」\\n「为什么不理我？」\\n「毕竟当年，你把他甩了，毫不留情。我看别家的女主都还会留一封信。」\\n「我当初都快死了，我还留信给他留念想，那才是缺大德。」\\n「那万一陆令野爱上别人了呢？」\\n不用思考，我脱口而出。\\n「陆令野不可能爱上别人，他永远都是我的。」\\n说完之后，我自己都愣住了。\\n我不知道自己能回来，更别提陆令野。\\n他会等着我吗？\\n等着一个不知道能不能回来的人？\\n现在正是上班高峰期，来来往往的人都要看我一下，甚至还有人嘴贱得很，问保安大哥。\\n「公司请了人来 cos 石狮子？」\\n我瞪他。\\n大哥摆摆手。\\n「她是来等人。」\\n那人来了兴趣。\\n「等人？等谁？」\\n保安大哥被问住了，他一愣，紧接着转头问我。\\n「对啊，你等谁？」\\n「等你们陆总，陆令野。」\\n我话音刚落，看到来人脸色变了一下。\\n他收起了嬉皮笑脸，脸色变得正经起来，一字一顿道。\\n「你等我哥？」\\n「你是，谢知宁？」\\n十二 \\n他好像还想再说些什么，一辆车缓缓开过来。\\n前排的司机下来给后座的人开车门。\\n那人一身黑西装，表情淡漠，只有我知道，他那昂贵的西装下面包裹的肌肉是多么让人血脉喷张。\\n喔，系统也知道。\\n他不耐烦地扫了一眼这边的闹剧，眼神甚至没有在我这边停留，转头就走。\\n身边紧跟着下车的女子拿着手包，倒是很有兴致地要往这边看，但是他并没有兴致等，所以她也只能一路小跑跟着他走了。\\n身边的男人看了我一眼。\\n「那就是我哥，看见了没？他甚至都没有往这边看一眼。」\\n「我劝你别想着知道点什么就想攀高枝，整容维持费很贵的吧？你以为你整成谢知宁，我哥就马上为你着魔，把你娶回家？」\\n我咬牙切齿。\\n「王八蛋。」\\n「哈？」\\n「明明知道我最讨厌李梦如，竟然还跟她混在一起！」\\n我仰着头。\\n男人凑上来。\\n「你流鼻血了吗？」\\n「不是，我想哭，仰着头，眼泪就不会流下来。」\\n「我能再要一份海鲜粥吗？」\\n对面的男人有些无语。\\n「行。」\\n他说他叫陆裴，是陆令野同父异母的弟弟。\\n我才知道陆令野竟然不是一个孤儿，年幼的他因为某些原因跟家里走散。后来意外相认。\\n他一脸好奇宝宝。\\n「你真是谢知宁啊？」\\n「你怎么知道我？」\\n「我哥书房里有你的照片啊！」\\n我语塞。\\n我甚至都不知道该怎么跟他解释我跟他哥的关系。\\n我们是相爱了？还是单纯的肉体吸引？\\n越想越心梗，我看着他手里的酒。\\n「给我来一杯。」\\n「这个度数很高的！」\\n瞧不起谁呢？\\n我一仰而尽。\\n然后倒在了桌子上。\\n陆裴好不容易把我弄下楼。\\n他扶着我，手忙脚乱地去摸车钥匙，我鼻子越来越酸。\\n「陆裴，陆裴…」\\n「你哥是王八蛋，他为什么不理我了？」\\n「他还说他永远是我的呢！」\\n「谁都抢不走，他自己都不行，他亲口说的。骗子！」\\n陆裴僵在了原地。\\n「我哥还说过这么肉麻的话呢？」\\n我大脑意识已经很不清醒了。\\n一边是今天下午陆令野跟李梦如走在一起的样子，一边是三年前，我们在沙滩上，他给我递椰子汁的故事。\\n我嘴上念念叨叨，没有意识到陆裴的眼神变了。\\n突然被打横抱起，我下意识上巴掌，陆令野的脸上出现了鲜红的巴掌印。\\n看清楚来人是谁的那一瞬间，眼泪倾盆而下。\\n「陆令野。」\\n「恩。」\\n「陆令野！」\\n「在。」\\n「你王八蛋！」\\n「恩，是我王八蛋。」\\n多日的委屈爆发了出来，我哭的根本刹不住，一路哭到了家，直到陆令野把我放在洗漱台上，他去试水温。\\n「陆令野。」\\n「恩？」\\n「你背叛我。」\\n陆令野拿着淋浴头的手一顿。\\n「没有。」\\n「你撒谎！」\\n试好了水温，陆令野站起来。\\n开始脱衣服。\\n我赶紧遮住自己的眼睛，只留了一个小缝偷看。\\n「你干什么？男女授受不亲！」\\n陆令野声音带着笑意。\\n「都亲过多少次了？你的哪里我没亲过？」\\n他带着我的手，摸上了自己的腹肌。\\n「三年了，看看我有没有懈怠。」\\n没有，手感依旧很好。\\n脑子里的系统又开始尖叫，我仿佛回到了三年前，丝毫没注意到，大手带着我的，一路向下。\\n「不……不行。」\\n「怎么不行？很行。」\\n脚放在他的肩膀上，我被背后的大理石冰的后背一抖。\\n热度攀升到最高处时，陆令野从兜里掏出什么拿出一个东西，用嘴撕开，哄我给他戴上。\\n我犹豫的三秒钟里，他突然反悔了，反手把它扔了。\\n「本来准备让你适应一下的。」\\n「但是现在不想了。」\\n他揉捏我的耳垂，惩罚性地在我的锁骨上落下一个又一个的吻。\\n「要进去，让你生一个孩子。」\\n毫无防备的进入让我条件反射地后退，刚想逃却进的更深。\\n释放的那一刻，滚烫的眼泪滴在我的身上。\\n「谢知宁，这一次，别再一声不吭把我扔了，好不好？」\\n十三\\n我醒了。\\n我的嗓子也哑了。\\n并且在我醒来的一瞬间，我发现自己的旁边放着银链子。\\n整个房间已经被收拾干净，陆令野推门进来，看到我，笑的阳光灿烂，好像昨晚无视我求饶的不是他。\\n「宁宁，吃饭。」\\n我指着旁边的银链子。\\n「你什么意思？」\\n他理所当然地。\\n「一边绑着你，另外一边绑着我。」\\n「专门为你定制的，喜欢吗？」\\n笑的那样开心，好像在跟我讨赏的小狗。\\n系统在我的脑子里感慨。\\n「完了，疯了。」\\n「但是只要你够乖，它就不会派上用场。」\\n虽然饭很好吃，但是我难以下咽。\\n有个人一直盯着你，谁还吃的下去啊！\\n当事人浑然不觉，帮我擦了擦嘴边的油，笑眯眯地。\\n「吃完我给你解释一下昨天的事。」\\n我吃不下去了。\\n「你说吧。」\\n我这才知道，原来我的复活，是因为陆令野。\\n当年系统从最开始就记错了剧本，这本书的女主是我，男主是陆令野，而李梦如是穿越进来的。\\n她可以夺走女主的气运，但是夺不走男主对女主的感情。\\n而当年李梦如在陆令野挥拳向吴驰的时候就对他有了好感，被陆令野发现后套话，也成功地让她爱上了陆令野，交出气运。\\n我几乎要气晕。\\n系统早就躲起来了。\\n「吴驰公司没了，要饭去了，李梦如用你的命要挟我跟她结婚，大概觉得我爱上她了。」\\n陆令野冷笑。\\n「自信过头了。」\\n「你想怎么处理？」\\n系统终于不再缩着。\\n「我把她带走吧！我们系统管理局会处罚她的！随便篡改别人气运，我们有惩罚规定，肯定让你们满意！」\\n「至于谢家……」\\n陆令野看向了我。\\n「当年你身死，他们很愧疚。现在气运还给了你，他们不再受控制，估计很想见你一面。」\\n我朝他释怀一笑。\\n「可是我不想见他们了。」\\n「就让他们以为我死了吧，就跟别人说，我是你找的替身，怎么样？」\\n陆令野蹭了蹭我。\\n「都听你的。」\\n「不过我听说了一件事。」\\n「某人似乎会游泳，却自己跳下湖让我救她，你说是为什么？」\\n感觉不对，我转头就跑。\\n却转头扎进了一个陌生的房间。\\n房间里的东西看得我一愣。\\n这不都是当年谢家扔出来的我的东西吗？\\n陆令野看着我感动的样子，表情十分古怪。\\n他按下一个开关，门缓缓升起，露出里面琳琅满目的玩具。\\n「你看着这些这么感动干嘛？」\\n陆令野恍然大悟。\\n「莫非你想跟我用？」\\n才不是呢！\\n王八蛋！"
	modify := "被竹马甩了后，我勾上了自己的糙汉保镖。\\n因为他腰细肩宽大长腿。\\n我调戏他。\\n【每个月的加班时间能不能都用在晚上？】擅长口技，且服务意识强。\\n【我暗示的这么明显，你怎么不上道呢。】\\n晚上，保镖吻去我细碎的喘息，笑着朝我的耳边吹气。\\n【怎么样？大小姐，我够上道吗?】终于在几个月后，我死遁逃跑。\\n再见面，他用嘴撕开包装。\\n【不，不用这个了，谢知宁，进去的话，是不是就没办法逃跑了？】\\n一\\n深夜，破旧的出租屋里，我坐在地上，抽抽噎噎地擦眼泪。\\n陆令野沉默着递给我一个面包跟一瓶水。\\n我红着眼睛把水递还给他，可怜巴巴地看着他。\\n他皱了下眉。\\n「谢知宁，这么娇气，恩？」\\n话是这么说，他还是去洗了手，帮我拧开了瓶盖。\\n我确实渴了，一边抽抽噎噎一边小口小口喝水。\\n陆令野沉默了一下。\\n「我去洗澡。」\\n他拎着衣服走进了浴室。\\n大概是察觉到了我的意图，脑子里的系统发出警告声。\\n「宿主，你这样的话，会出事！你会死！你的攻略目标是你的竹马吴驰！」\\n系统的尖叫声无比刺耳。\\n一个小时前。\\n陆令野作为我的保镖，送我去一个晚会。\\n黑色背心遮不住鼓鼓囊囊的胸肌，小麦色的皮肤裸露在外，看的人血脉喷张。\\n他斜靠在车上不知道在想什么，目光散漫随性。\\n不过几分钟的功夫，已经有好几个入场的贵妇盯着他了。\\n「那是哪家小姐的宠物？」\\n「那公狗腰看得我好馋。」\\n「你真是……不过这是谁家死丫头吃的这么好，咱们去把他要过来玩几天。」\\n「一起吗？他肯定游刃有余。」\\n窃窃私语混着笑声传来，我有点莫名的怒火。\\n「反正也没有三个月好活了，我就要及时行乐。我就不能醉一回吗？」\\n我快死了，还有三个月。\\n十岁那年，我的脑子里出现了一个系统。\\n在它出现之后，我莫名其妙爱上了本来不在意的竹马吴驰。\\n它让我去攻略吴驰，获得他的喜爱值，结果这么多年，喜爱值一点没增。\\n直到昨天我才知道原因。\\n我只是一本书里的女二，真正的女主已经出现，我这个女二将在三个月后为男女主让道，突然身亡。\\n我的人生变成了一个笑话。\\n系统自知理亏，不再干扰我的心动。\\n于是在清醒过来的那一瞬间，我看着保镖陆令野，红了脸。\\n我要得到他！\\n我果断选择跃入水中。\\n周围响起惊呼的瞬间，一个矫健的身影游了过来。\\n而我所做的，是贴了上去，肆无忌惮地吻上他的嘴唇。\\n柔若无骨的手在他的身上肆意点火，很快摸到了那个让一群贵妇讨论的所在。\\n感觉到它叫嚣着想冲出牢笼的时候，我满意地笑了。\\n二\\n我当然不会告诉陆令野，我是为了占他便宜才跳下去的。\\n就像我不会告诉他，我从小熟识水性一样。\\n我把这件事全部推到了吴驰的身上，把自己伪装成一个失恋者，哭的梨花带雨，让陆令野带我回家。\\n他是不会拒绝的。\\n门的隔音并不好，水声传来，我都可以想象到，水滴顺着性感的锁骨一路而下，路过人鱼线，流向隐秘之处。\\n我摇了摇脑袋。\\n系统还在疯狂叫嚣，指责我的举动。\\n陆令野刚好在这个时候推门出来。\\n他没有穿上衣，只随便围了一条浴巾。\\n我看着他劲瘦有力的腰，想起白天那些贵妇的话，我的脸红到了耳朵根。\\n系统发出了一声花痴的尖叫。\\n这声尖叫成功地点燃了我。\\n我走上前去，鼓起勇气，伸手摸上了我白天打量的地方。那对鼓鼓囊囊的胸肌。\\n手感真是。\\n太棒了！真好。\\n怪不得我朋友经常去会所一掷千金。\\n吃的真好。\\n陆令野显然对我大胆的举动有些震惊。\\n不过也只是一瞬间。\\n他挑了挑眉，随性地靠在桌子边，任由我的手一路向下。\\n「怎么，大小姐，被欺负了就要占我的便宜？」\\n他不说还好，一说我的眼睛就红了。\\n我恶狠狠地抬头盯着他。\\n「就占你便宜，不行吗？」\\n女孩儿大概以为自己很凶，很有威慑力，殊不知落在别人的眼里，简直是像一只张牙舞爪的小兔子。\\n陆令野的喉咙里发出了一声愉悦的低笑。\\n「占便宜，当然可以。」\\n他凑近我，滚烫的气息打在我的耳后，烫的我一哆嗦。\\n带着薄茧的手覆上我的，来到蛰伏处。\\n「不过，大小姐，怎么这么笨笨的呢？」\\n「占便宜应该是这么占的才对。」\\n室内的温度节节攀升，烫的我腰软。\\n迷迷糊糊之间，我觉得自己软成了一滩水。\\n陆令野的手隔在我的腰跟桌子之间，看着我泪眼朦胧，小声求饶跟他说。\\n「站不住了……」\\n他单只手把我抱了起来，放在了桌子上。\\n脑子里的系统已经震惊地只会尖叫了。\\n温度攀升到最高点时，陆令野及时醒过来。\\n我不知道他突然停下的原因，只知道自己不知名的难受，这难受逼得我眼泪都快出来了。\\n我小声地喊他的名字。\\n我觉得现在的他像一把崩到极致的弓。\\n我的腿缠在他的腰上，有点委屈。\\n难道是我没有诱惑力吗？\\n他为什么这个时候还要停？\\n还是他觉得我喜欢吴驰，不想碰我？\\n我越想越委屈，几乎想马上抽身离开。\\n三\\n「陆令野，你是不是男人，这个时候你还能停……」\\n我委屈极了。\\n「你不感兴趣就算了，我去找别人。」\\n刚转头就被拉进了一个炙热的怀抱。\\n男人强有力的心跳声回响在耳边，喘息声听得我脸发烫。\\n「谢知宁，对自己要自信。」\\n他喘息着，带着我的手摸去摸向胯下，巨物不再蛰伏，规格大的让我心惊。\\n被情欲冲昏的脑袋瞬间清醒，我突然有点怂了。\\n「不能在这里，这里环境太差了。」\\n陆令野吻去我脸上的泪水，带着薄茧的大手一路向下。\\n手指宛若灵活的蛇，潜入花丛中，曲径通幽处。\\n我被烫的一抖，仰着脖子，一声喟叹。\\n「公主……」\\n「今天晚上，我只要你舒服。」\\n我是被电话吵醒的。\\n电话那头的吴驰开门见山，滔滔不绝讲了五分钟。\\n但是我太困了，一句没听懂。\\n系统恨铁不成钢，出来帮我总结。\\n但是由于昨晚吃瓜吃的太震惊，一晚上都在尖叫，它现在开嗓都有点哑。\\n「他说，他要跟你退婚，跟女主结婚。」\\n我「喔」了一声，从床上坐起来。\\n陆令野一大早就去工地了，给我留了纸条。\\n「早饭在锅里，吃完不准乱跑，等我回来。」\\n大概怕我不听劝，他在后面又加了一句。\\n「这边很乱，乱跑的话会被坏人抓走。」\\n我笑出了声。\\n手机那边的吴驰还在说话，听到我笑，声音一停。\\n「谢知宁，你笑什么？」\\n我懒得理他，挂断了电话。\\n四\\n外面晾着的床单昭示着我们昨晚的疯狂。\\n心情好，系统的公鸭嗓听起来都分外悦耳。\\n「第一次看到这么有服务意识的男主，遇到这种的，你就嫁了吧。」\\n见我不搭理它，它死心不改，继续八卦。\\n「昨天他在浴室里待了快四十分钟唉，那如果真枪实战，你扛得住吗？」\\n「……」\\n不知为什么，陆令野今天回来得格外的早。\\n这次从浴室出来，他连浴巾都没围。\\n我只看了一眼，像被烫到了一样，赶紧转了过去。\\n系统尖叫一声。\\n真是为难它了，嗓子都这样了，还能叫成女高音。\\n不对啊谢知宁，这是想这个的时候吗？\\n「这个 size！谢知宁啊啊啊啊啊啊啊，我跟你说的你都记住了吧！」\\n「死丫头吃的真好，我都要嫉妒你了。」\\n系统贱兮兮的声音回响。\\n下午在等陆令野的时候，它偷偷给我传授了很多秘籍。\\n但是我现在一紧张，忘光了。\\n我欲哭无泪。\\n书到用时方恨少。\\n我平时应该多读点书的。\\n不知道是谁先动的，等我回过神时，人已经身在酒店了。\\n前台小姐姐用吃瓜的眼神看了我们一眼，贼笑着开了一家房。\\n等看到房间里那间水床时，我惊讶地看了陆令野一眼。\\n这下轮到他脸红了。\\n说话都有些语无伦次了。\\n「不是，我开的不是这种，我去换一间。」\\n还换什么！\\n我伸手拉下他的背心，踮着脚吻了上去。\\n我们从门口吻到了浴缸。\\n房间的温度升到最高点时，我的背抵在冰凉的大理石上，身前滚烫是滚烫的小麦色肉体，劲瘦的耸动的腰让我想起了那几个贵妇的话。\\n不愧是有经验的。\\n看人真准。\\n……\\n第二天早上又是电话叫醒的我。\\n我不耐烦地摁掉电话，往陆令野的怀里缩了缩。\\n电话声锲而不舍。\\n我刚想发火，一只大手把我拿过电话，接通了放在我的耳边。\\n我对着那只手，奖励式地亲了一口，才对着电话「喂」了一声。\\n电话那头的声音熟悉又惹人烦。\\n「谢知宁。」\\n吴驰的语气很暴躁。\\n「你他妈人在哪儿？你敢跟野男人去开房！还是我家的酒店！你是故意的吗！」\\n放在我腰间的手动了一下。\\n女孩儿亮晶晶的眼神看着自己，像是挑衅。\\n「是那个？吴家的那个少爷？还是你那个打游戏的朋友？」\\n陆令野若有所思地看了我一眼。\\n我心虚地缩了缩脖子。\\n轻声跟他解释。\\n「吴家那个少爷是我好朋友，打游戏的那个是我资助的，这是投资，投资而已。」\\n陆令野挑了挑眉，不急不慢地「喔」了一声。\\n「你在跟谁说话？你真的养了野男人是不是！」\\n吴驰咆哮。\\n陆令野贴心地帮我把手机拿远了点。\\n我不理解吴驰破防什么。\\n在我的生日宴上拉着女朋友官宣的是他，漫不经心地跟别人说我只是他的舔狗的也是他。\\n可我眼下无暇顾及他。\\n只因身后顶着我的巨物。\\n陆令野起身把我抱了起来。\\n手机差点拿不稳，我惊呼一声。\\n我这才发现房间的抽屉里竟然藏着这么多莫名其妙的东西。\\n陆令野一只手抱着我，一只手在抽屉里翻找。\\n在看到那只皮质手铐时，我腿有点软。\\n吴驰还在嗷嗷咆哮。\\n陆令野用嘴撕开了包装，打开了手铐。\\n「咔哒」一声。\\n预想之中的触感没有传来。\\n陆令野拷上了自己的手。\\n「想要吗，谢知宁。」\\n「想要的自己争取。」\\n五\\n三天后。\\n一打开手机，铺天盖地的消息冲了进来。\\n第一个就是吴驰的电话。\\n陆令野正在帮我穿鞋，手上的薄茧蹭到我的脚心，有些痒。\\n「我说谢知宁，外面找你都快找疯了你知道吗，跟野男人厮混起来就不知廉耻了？」\\n他的声音有点冷。\\n「我要退婚约，你最好现在就滚回来，我在你家。」\\n陆令野手上的动作顿了一下。\\n我没注意到，他的眼神有点冷。\\n觉醒后我才发现，我身边的一切都是为了吴驰跟女主李梦如服务的。\\n我的父母像中邪了一样，他们看重吴驰更甚于我这个亲生女儿，甚至把李梦如当女儿一样养着。\\n是以他们知道我跟陆令野的事时，第一反应就是暴怒。\\n母亲更是怒不可遏地甩了我一巴掌。\\n李梦如惊呼一声。\\n「伯母，您别生气，姐姐肯定也不是故意的。」\\n楚楚可怜的眼神看向我，说出来的话看似为我开脱，实则句句都把我定在耻辱柱上。\\n「姐姐一定是因为我跟吴驰哥哥的事，伤心过度才会做出这种傻事的。」\\n「不过姐姐，再伤心也不能作践自己啊。」\\n「如如，你别劝我！我就当没有这个女儿！」\\n「败坏家风的东西！」\\n怒斥声，叫骂声，混合着劝架声。\\n逼得我无所遁形。\\n吴驰在旁边站着，冷漠地看着我，不发一语。\\n我只觉得天旋地转。\\n良久，鼻尖一热。\\n我摸到了一手血。\\n我是在医院的病床上醒来的。\\n陆令野趴在我床边，留给我一个寸头。\\n我突然想到了腿上的触感，脸一红。\\n大概是感觉到了我的视线，陆令野醒来。\\n不知道他这个姿势维持了多久，他的脸上压出了红色的印子。\\n还没有等他开口。\\n我笑着看着他。\\n眼泪不自觉滑落。\\n「陆令野，我没有家了，你能收养我吗？」\\n六\\n我不知道我的父母是什么时候改变的。\\n记忆里，他们一直把吴驰视作亲儿子，从小到大，如果我惹吴驰生气，他们就会怒不可遏。\\n我一直以为他们喜欢的是吴驰的家产，吴驰能带来的财富。\\n我现在才知道。\\n他们只是不喜欢我。\\n女主出现不过一月，就已经住进我家，得到了我的一切。\\n而我，只是因为不再按照剧情走，就会得到所有人的憎恶。\\n直到三个月后被抹杀。\\n系统显然比我还要低落。\\n它安慰我。\\n「没事的，谢知宁。」\\n它也词穷了。\\n喜爱值不够，我攻略不下吴驰，寿命就会一天天耗尽。\\n而我们都没有办法。\\n吴驰找到我时，我正学着陆令野的样子，把衣服丢进洗衣机里。\\n娇生惯养惯了，我很不习惯做家务，显得很是手忙脚乱。\\n李梦如的得意溢于言表。\\n「宁宁，只要你回去认个错，爸爸妈妈会原谅你的。」\\n爸爸妈妈？\\n我愣了一下，她惊呼一声，娇俏地捂住嘴。\\n「对不起啊宁宁，他们认了我当干女儿，我想过段时间再告诉你的。」\\n系统都听不下去了。\\n「嘴真欠，得了便宜还卖乖。」\\n我没说话，只是按下按键。\\n「没有父母的话，可以去拼一个。」\\n陆令野淡漠的声音从身后传来。\\n「不要去抢别人的父母。」\\n李梦如漂亮的小脸气成了猪肝红。\\n吴驰皱着眉头看着我。\\n「谢知宁，如果只是为了气我，没必要这么糟践你自己。」\\n「你这样跟一个婊子有什么区别？」\\n他的话还没说完，已经被一拳头撂翻在地。\\n我这才发现陆令野不只是在某些方面比较猛。\\n清脆的鼻骨断裂声传来。\\n陆令野漫不经心地点了一根烟。\\n转身按在了吴驰的身上。\\n七\\n我被叫回了谢家。\\n陆令野等在楼下，再三确认。\\n「真的不让我跟你进去？」\\n我假装轻松地拍拍他。\\n「你要是进去他们肯定更生气，放心吧，他们总归是我的亲生父母，不会把我怎么样的。」\\n跟上次的勃然大怒不同，父母看我的眼神冷漠的好像在看陌生人。\\n母亲把一份协议书推到我的面前。\\n「签了吧。」\\n协议很长，生怕我跟李梦如分财产，上面把一切都规划的清清楚楚。\\n给我三百万。\\n前提是我需要断绝跟谢家的关系，除了还姓谢，其他的一切都得跟谢家断的干干净净。\\n有人上上下下，我看得分明，他们手里抱着的是我的东西。\\n我从小到大的照片，我的奖杯，我画的画，都被收拾出来，扔了出去。\\n见我盯着他们的动作，母亲突然有些不自在。\\n她干咳了一声。\\n「反正你也不在谢家住了，那些东西梦如看着难受，索性就扔了。」\\n「如果你要的话……」\\n父亲强硬的声音打断了她的话。\\n「还要干什么？以后拿着这些来认祖归宗，跟梦如分家产吗？」\\n他指着我，病态地颤抖。\\n「生养你这样的女儿，简直是我一辈子的耻辱！」\\n「要不是有梦如，我早就被你气死了！」\\n李梦如在旁边，乖巧地给他拍背，善解人意的样子谁看了都喜欢。\\n「姐姐，你不要再气爸爸了，他为了你的事，已经很操劳了。」\\n「梦如，别再跟她叫姐姐，她从今天开始，跟我们谢家一点关系都没有！」\\n我看着他们把那张全家福拿下来，换上了他们跟李梦如一起拍的全家福。\\n不再犹豫，我干脆利落地签上了自己的名字。\\n接过协议的那一刻，母亲的眼里闪烁着泪花。\\n但是随即，像是被什么控制住，她的眼神重归冷漠。\\n「签好了的话，你就走吧。」\\n「看在我们的面子上，吴驰那孩子才没有找那个野男人的麻烦，只不过如果再有下次，我们不会放过他。」\\n她犹豫了一下，最后看了我一眼。\\n「你以后，自重保重吧。」\\n八\\n陆令野等在楼下，他看向我，眼里都是关切。\\n我挤出了一个比哭还难看的笑。\\n「陆令野，一切都快结束了。」\\n落入温暖的怀抱，我终于落到了实处，嚎啕大哭。\\n明明一个月前，还是父母疼爱的大小姐，有未婚夫，有美好的生活。\\n可是女主出现了，我这个女二在阳光下，只能现出了原形。\\n「什么都是她的，爸爸妈妈是她的，男主是她的，连命马上也没了。」\\n陆令野身体一僵。\\n「什么？」\\n我意识到说漏了嘴，揪着他的衣服擦眼泪，他又好气又好笑。\\n「陆令野，你会永远是我的吗？」\\n他吻掉我的眼泪。\\n「会，永远都会。谁都没办法从你身边抢走我。我自己都不行。」\\n我哭的更大声了。\\n泪眼朦胧中，我看到李梦如的身影。\\n还有她嫉妒到恐怖的眼神。\\n我跟陆令野去旅行了。\\n拿着那三百万。\\n不得不承认，自己出去玩儿跟身边有男朋友是不一样的，特别是很有服务意识的男朋友。\\n我穿着比基尼，开心地踩沙子。\\n有不少人过来搭讪，但是看到我身后穿着沙滩裤，裸着上半身的陆令野，马上表明自己只是来借个火。\\n我抢过陆令野的墨镜戴在自己的脸上。\\n「都怪你，坏了我多少桃花！」\\n后者无奈摊手。\\n「那怎么办，大小姐，我以身抵债好不好？」\\n「不好！」\\n我指着他的沙滩裤。\\n「不准穿的这么勾人！」\\n这一会儿我看到好几个女孩子往这边看了！\\n陆令野商量的语气。\\n「那我明天出来的时候，穿羽绒服？」\\n我思考了一下。\\n「行。」\\n接过他递过来的椰子汁，我小声问。\\n「我穿比基尼，你会吃醋吗？」\\n「有一点。」\\n「那你干嘛不阻止我？」\\n陆令野帮我涂防晒的手一顿。\\n「我在你旁边呢，想穿什么就穿。」\\n我无声地笑了。\\n可是陆令野，你不能保护我一辈子啊。\\n我马上就要被抹杀了。\\n抹杀的时间越来越近，我常常说话说着说着，鼻血就流下来。\\n第一次这样是在我们接吻的时候，刚到房间，陆令野刚脱上衣，两道鼻血飞流而下。\\n他惊讶地挑眉。\\n「我的魅力这么大吗？」\\n这种情况越来越频繁，他意识到了不对劲，要带我去看医生，被我拒绝了。\\n医生是治不好的。\\n剩下的时间里我只想一直跟他待在一起。\\n我们旅行的最后一天，两个人都默契地选择不出门，待在房间里。\\n没有做任何事情，只是安静地待在一起。\\n最开始只是单纯地为了反抗自己作为女二的命运找上的他，没想到最后，唯一一个对抗情节站在我身边的人，是他。\\n还有一个不是人，系统。\\n「那你呢？你为什么喜欢我？」\\n陆令野没有搭话。\\n我看到他的脸红到了耳朵根。\\n「不说就算了，看你这么纯情。」\\n我装作沉沉睡去，朦胧之中，感觉到自己的手指被套上了一枚戒指。\\n他似乎是在确认尺寸，确认无误后想小心翼翼取下来。\\n我却不愿意成全他，装作沉睡中，翻了个身，把戒指压在了身下。\\n大概是怕吵醒我，陆令野轻轻亲了我一下，下床去打电话。\\n我听到了「订花」「气球」之类的词。\\n两行清泪没入枕头中。\\n九\\n我把剩下的钱给了陆令野，找了个安静的地方等死。\\n每天沉睡的时间越来越长，醒来的时候天都黑了。我习惯性的去摸身边，却再也没有摸到熟悉的温度。\\n旁边是冷的，我的心也是冷的。\\n我的反应越来越迟钝。有时候系统跟我说话我都要反应很久。\\n「对不起啊，我是个没用的宿主，害得你和我一起被抹杀了。」\\n系统的声音带上哭腔。\\n「我也是个没用的系统，好不容易找到一个十八禁男主，你还是得死。」\\n一人一统哭成狗。\\n我让系统去打听陆令野的消息，但是它也越来越虚弱，刚开始还能放点朦胧的片段，后面却越来越少，最后连声音都没了。\\n那天早上醒来后他是准备求婚的，发现我不见了的那一瞬间，他还以为我在跟他开玩笑。\\n直到他发现我真的不见了。\\n一路跌跌撞撞冲下去调监控，到处找我，大街小巷贴告示。\\n他甚至走投无路，去求了谢家。\\n我看到他跪在谢家门口求他们动用人脉帮忙，却被告知，谢家跟我不再有任何关系。\\n片段停在了这里。\\n我也再次昏睡了过去。\\n我在系统的哭声中醒来。\\n人在死之前是能感觉到自己的大限将至的，我躺在床上，看着电视上直播吴驰跟李梦如的婚礼。\\n父亲母亲坐在上位，作为李梦如的父母出席，眼神无比欣慰。\\n我终于要死了。\\n在我手脚冰凉的那一瞬间，电视上的夫人，流下了一行眼泪。\\n不知道为什么她突然想到了自己那个不争气的女儿。\\n可能是梦如找到了自己的幸福，太激动了吧。\\n她想。\\n十\\n三年后。\\n我在系统惊喜的叫声中惊醒。\\n我没想到自己还能再醒来，系统扫描我的健康情况，惊讶的发现一切指标竟然恢复了正常。\\n三年没吃没喝，我竟然没死！\\n我痛哭流涕，第一件事就是奔到面馆里，要了三碗牛肉面。\\n我竖起三根手指。\\n老板挑眉。\\n「加三个鸡蛋？」\\n「不，每碗加三份牛肉。」\\n老板的脸色瞬间石化。\\n我听到他跟老板娘嘀咕。\\n「没吃过饭似的。」\\n我一边大口吃面，一边听店里电视上的娱乐新闻。\\n「你醒了第一件事，竟然不是去找陆令野？」\\n「我得先吃饭吧，我要饿死了。」\\n新闻上正在放最近的一对明星夫妻闹离婚。主持人八卦完之后，紧接着播放了另外一个新闻。\\n我听到了熟悉的名字。\\n「知名女星李梦如近日与丈夫吴总闹离婚，其原因竟是多年出轨！」\\n「据悉，李梦如出轨对象是大亨陆令野！」\\n咣当。\\n我的筷子应声掉地。\\n在老板鄙视的眼神中，我硬着头皮问他，能不能洗碗抵债。\\n或者是先欠着，等我找到人就来给他钱。\\n为了证明我话的可信度，我指着身后电视上的陆令野的镜头。\\n这厮现在混的特别好，据说是开了一个公司，还当了什么协会会长，三天两头上电视，生怕别人认不出他似的。\\n「这个人看见了吧？他最开始开公司的本金还是我给的！」\\n「等我找到他，让他翻五倍给你！十倍都行！」\\n我言辞恳切，感情激动，生怕老板以为我是个骗子，来吃霸王餐。\\n老板显然是一个好心人，他点了点头，表示他相信我。\\n「你跟这位陆总什么关系啊？」\\n我有点不好意思。\\n「我两以前谈恋爱来着。」\\n老板跟老板娘对视了一眼。\\n「行，你走吧，我相信你，你看着也不是那骗钱的人。」\\n果然这世界上还是好人多啊。\\n我流泪出了门，发誓等我找到陆令野，一定让他把这个店买下来，感谢老板老板娘的善良。\\n结果我人刚跨出门，就听到两人背后蛐蛐我。\\n「一看就脑子不好使，大冬天穿个裙子，还破破烂烂的。」\\n「算了，得罪疯子太可怕了，就当积德行善了。」\\n我。\\n「……」\\n等我找到陆令野，我还是会让他把店买下来。\\n让他们四眼看人坏！\\n十一\\n陆令野的公司简直不要太好找。\\n我带着系统找到他公司的前台，敲了敲桌子。\\n「你好，我找陆令野。」\\n前台小姑娘愣了一下。\\n「啥？」\\n我耐心地重复了一遍。\\n前台小姑娘的态度不错，让我坐下来等。\\n我刚坐下来就听到她给保卫处打电话。\\n好歹也是前谢家大小姐，现在到处被当成疯子。\\n我也是有骨气的，转头就走。\\n不让我在里面等，我在外面等不就行了？\\n我蹲在门口石狮子那里，冻得瑟瑟发抖，旁边保安大哥看了我好几眼，终于叹了口气，把他的军大衣扔给了我。\\n我带着哭腔。\\n「大哥，你真好。」\\n终于遇到一个不把我当疯子的人了！\\n大哥摆摆手，两坨高原红不知道是冻得还是怎么，红到了耳朵根，让他看上去异常朴实。\\n「小事儿，你再蹲一会儿就去找你家人，让他们带你去看病吧。」\\n「老是这么拖着也不是个事儿。」\\n「……」\\n肤浅。\\n我一边等，一边跟系统聊天。\\n「你觉得陆令野还会理你吗？」\\n「为什么不理我？」\\n「毕竟当年，你把他甩了，毫不留情。我看别家的女主都还会留一封信。」\\n「我当初都快死了，我还留信给他留念想，那才是缺大德。」\\n「那万一陆令野爱上别人了呢？」\\n不用思考，我脱口而出。\\n「陆令野不可能爱上别人，他永远都是我的。」\\n说完之后，我自己都愣住了。\\n我不知道自己能回来，更别提陆令野。\\n他会等着我吗？\\n等着一个不知道能不能回来的人？\\n现在正是上班高峰期，来来往往的人都要看我一下，甚至还有人嘴贱得很，问保安大哥。\\n「公司请了人来 cos 石狮子？」\\n我瞪他。\\n大哥摆摆手。\\n「她是来等人。」\\n那人来了兴趣。\\n「等人？等谁？」\\n保安大哥被问住了，他一愣，紧接着转头问我。\\n「对啊，你等谁？」\\n「等你们陆总，陆令野。」\\n我话音刚落，看到来人脸色变了一下。\\n他收起了嬉皮笑脸，脸色变得正经起来，一字一顿道。\\n「你等我哥？」\\n「你是，谢知宁？」\\n十二 \\n他好像还想再说些什么，一辆车缓缓开过来。\\n前排的司机下来给后座的人开车门。\\n那人一身黑西装，表情淡漠，只有我知道，他那昂贵的西装下面包裹的肌肉是多么让人血脉喷张。\\n喔，系统也知道。\\n他不耐烦地扫了一眼这边的闹剧，眼神甚至没有在我这边停留，转头就走。\\n身边紧跟着下车的女子拿着手包，倒是很有兴致地要往这边看，但是他并没有兴致等，所以她也只能一路小跑跟着他走了。\\n身边的男人看了我一眼。\\n「那就是我哥，看见了没？他甚至都没有往这边看一眼。」\\n「我劝你别想着知道点什么就想攀高枝，整容维持费很贵的吧？你以为你整成谢知宁，我哥就马上为你着魔，把你娶回家？」\\n我咬牙切齿。\\n「王八蛋。」\\n「哈？」\\n「明明知道我最讨厌李梦如，竟然还跟她混在一起！」\\n我仰着头。\\n男人凑上来。\\n「你流鼻血了吗？」\\n「不是，我想哭，仰着头，眼泪就不会流下来。」\\n「我能再要一份海鲜粥吗？」\\n对面的男人有些无语。\\n「行。」\\n他说他叫陆裴，是陆令野同父异母的弟弟。\\n我才知道陆令野竟然不是一个孤儿，年幼的他因为某些原因跟家里走散。后来意外相认。\\n他一脸好奇宝宝。\\n「你真是谢知宁啊？」\\n「你怎么知道我？」\\n「我哥书房里有你的照片啊！」\\n我语塞。\\n我甚至都不知道该怎么跟他解释我跟他哥的关系。\\n我们是相爱了？还是单纯的肉体吸引？\\n越想越心梗，我看着他手里的酒。\\n「给我来一杯。」\\n「这个度数很高的！」\\n瞧不起谁呢？\\n我一仰而尽。\\n然后倒在了桌子上。\\n陆裴好不容易把我弄下楼。\\n他扶着我，手忙脚乱地去摸车钥匙，我鼻子越来越酸。\\n「陆裴，陆裴…」\\n「你哥是王八蛋，他为什么不理我了？」\\n「他还说他永远是我的呢！」\\n「谁都抢不走，他自己都不行，他亲口说的。骗子！」\\n陆裴僵在了原地。\\n「我哥还说过这么肉麻的话呢？」\\n我大脑意识已经很不清醒了。\\n一边是今天下午陆令野跟李梦如走在一起的样子，一边是三年前，我们在沙滩上，他给我递椰子汁的故事。\\n我嘴上念念叨叨，没有意识到陆裴的眼神变了。\\n突然被打横抱起，我下意识上巴掌，陆令野的脸上出现了鲜红的巴掌印。\\n看清楚来人是谁的那一瞬间，眼泪倾盆而下。\\n「陆令野。」\\n「恩。」\\n「陆令野！」\\n「在。」\\n「你王八蛋！」\\n「恩，是我王八蛋。」\\n多日的委屈爆发了出来，我哭的根本刹不住，一路哭到了家，直到陆令野把我放在洗漱台上，他去试水温。\\n「陆令野。」\\n「恩？」\\n「你背叛我。」\\n陆令野拿着淋浴头的手一顿。\\n「没有。」\\n「你撒谎！」\\n试好了水温，陆令野站起来。\\n开始脱衣服。\\n我赶紧遮住自己的眼睛，只留了一个小缝偷看。\\n「你干什么？男女授受不亲！」\\n陆令野声音带着笑意。\\n「都亲过多少次了？你的哪里我没亲过？」\\n他带着我的手，摸上了自己的腹肌。\\n「三年了，看看我有没有懈怠。」\\n没有，手感依旧很好。\\n脑子里的系统又开始尖叫，我仿佛回到了三年前，丝毫没注意到，大手带着我的，一路向下。\\n「不……不行。」\\n「怎么不行？很行。」\\n脚放在他的肩膀上，我被背后的大理石冰的后背一抖。\\n热度攀升到最高处时，陆令野从兜里掏出什么拿出一个东西，用嘴撕开，哄我给他戴上。\\n我犹豫的三秒钟里，他突然反悔了，反手把它扔了。\\n「本来准备让你适应一下的。」\\n「但是现在不想了。」\\n他揉捏我的耳垂，惩罚性地在我的锁骨上落下一个又一个的吻。\\n「要进去，让你生一个孩子。」\\n毫无防备的进入让我条件反射地后退，刚想逃却进的更深。\\n释放的那一刻，滚烫的眼泪滴在我的身上。\\n「谢知宁，这一次，别再一声不吭把我扔了，好不好？」\\n十三\\n我醒了。\\n我的嗓子也哑了。\\n并且在我醒来的一瞬间，我发现自己的旁边放着银链子。\\n整个房间已经被收拾干净，陆令野推门进来，看到我，笑的阳光灿烂，好像昨晚无视我求饶的不是他。\\n「宁宁，吃饭。」\\n我指着旁边的银链子。\\n「你什么意思？」\\n他理所当然地。\\n「一边绑着你，另外一边绑着我。」\\n「专门为你定制的，喜欢吗？」\\n笑的那样开心，好像在跟我讨赏的小狗。\\n系统在我的脑子里感慨。\\n「完了，疯了。」\\n「但是只要你够乖，它就不会派上用场。」\\n虽然饭很好吃，但是我难以下咽。\\n有个人一直盯着你，谁还吃的下去啊！\\n当事人浑然不觉，帮我擦了擦嘴边的油，笑眯眯地。\\n「吃完我给你解释一下昨天的事。」\\n我吃不下去了。\\n「你说吧。」\\n我这才知道，原来我的复活，是因为陆令野。\\n当年系统从最开始就记错了剧本，这本书的女主是我，男主是陆令野，而李梦如是穿越进来的。\\n她可以夺走女主的气运，但是夺不走男主对女主的感情。\\n而当年李梦如在陆令野挥拳向吴驰的时候就对他有了好感，被陆令野发现后套话，也成功地让她爱上了陆令野，交出气运。\\n我几乎要气晕。\\n系统早就躲起来了。\\n「吴驰公司没了，要饭去了，李梦如用你的命要挟我跟她结婚，大概觉得我爱上她了。」\\n陆令野冷笑。\\n「自信过头了。」\\n「你想怎么处理？」\\n系统终于不再缩着。\\n「我把她带走吧！我们系统管理局会处罚她的！随便篡改别人气运，我们有惩罚规定，肯定让你们满意！」\\n「至于谢家……」\\n陆令野看向了我。\\n「当年你身死，他们很愧疚。现在气运还给了你，他们不再受控制，估计很想见你一面。」\\n我朝他释怀一笑。\\n「可是我不想见他们了。」\\n「就让他们以为我死了吧，就跟别人说，我是你找的替身，怎么样？」\\n陆令野蹭了蹭我。\\n「都听你的。」\\n「不过我听说了一件事。」\\n「某人似乎会游泳，却自己跳下湖让我救她，你说是为什么？」\\n感觉不对，我转头就跑。\\n却转头扎进了一个陌生的房间。\\n房间里的东西看得我一愣。\\n这不都是当年谢家扔出来的我的东西吗？\\n陆令野看着我感动的样子，表情十分古怪。\\n他按下一个开关，门缓缓升起，露出里面琳琅满目的玩具。\\n「你看着这些这么感动干嘛？」\\n陆令野恍然大悟。\\n「莫非你想跟我用？」\\n才不是呢！\\n王八蛋！"

	arr := make([]DiffData, 0)
	diffs := dmp.DiffMain(origin, modify, false)
	data := DiffData{}
	for j, diff := range diffs {
		text := diff.Text
		text = text
		if diff.Type == diffmatchpatch.DiffEqual {
			if strings.Contains(diff.Text, "\n") {
				splitText := strings.Split(diff.Text, "\n")
				for i, s := range splitText {
					if i == 0 {
						data.ModifyText += s
						arr = append(arr, data)
						data = DiffData{}
						continue
					}
					if strings.TrimSpace(s) == "" {
						continue
					}
					if i == len(splitText)-1 {
						data.ModifyText = s
						if j == len(diffs)-1 {
							arr = append(arr, data)
						}
						continue
					}
					data.ModifyText = s
					arr = append(arr, data)
					data = DiffData{}
				}
			} else {
				data.ModifyText += diff.Text
				if j == len(diffs)-1 {
					arr = append(arr, data)
					continue
				}
			}
		}

		if diff.Type == diffmatchpatch.DiffInsert {
			if strings.Contains(diff.Text, "\n") {
				splitText := strings.Split(diff.Text, "\n")
				for i, s := range splitText {
					if i == 0 {
						data.ModifyText += s
						if strings.TrimSpace(s) != "" {
							data.AddText = append(data.AddText, s)
						}
						arr = append(arr, data)
						data = DiffData{}
						continue
					}
					if s == "" {
						continue
					}
					if i == len(splitText)-1 {
						data.ModifyText = s
						if strings.TrimSpace(s) != "" {
							data.AddText = append(data.AddText, s)
						}
						if j == len(diffs)-1 {
							arr = append(arr, data)
						}
						continue
					}
					data.ModifyText = s
					if strings.TrimSpace(s) != "" {
						data.AddText = append(data.AddText, s)
					}
					arr = append(arr, data)
					data = DiffData{}
				}
			} else {
				data.ModifyText += diff.Text
				data.AddText = append(data.AddText, diff.Text)
			}

		}
		if diff.Type == diffmatchpatch.DiffDelete {
			//if strings.Contains(diff.Text, "\n") {
			//	splitText := strings.Split(diff.Text, "\n")
			//	for i, s := range splitText {
			//		if i == 0 {
			//			data.ModifyText += s
			//			arr = append(arr, data)
			//			data = DiffData{}
			//			continue
			//		}
			//		if strings.TrimSpace(s) == "" {
			//			continue
			//		}
			//		if i == len(splitText)-1 {
			//			data.ModifyText = s
			//			if j == len(diffs)-1 {
			//				arr = append(arr, data)
			//			}
			//			continue
			//		}
			//		data.ModifyText = s
			//		arr = append(arr, data)
			//		data = DiffData{}
			//	}
			//} else {
			//	data.ModifyText += diff.Text
			//	if j == len(diffs)-1 {
			//		arr = append(arr, data)
			//		continue
			//	}
			//}
			if strings.TrimSpace(diff.Text) != "" {
				data.DeleteText = append(data.DeleteText, diff.Text)
			}
		}
	}
	println("-------")
	s := ""
	for _, one := range arr {
		println("++")
		println(one.ModifyText)
		println("++==")
		s = s + one.ModifyText + "a"
		println(s)
		println("++==")
	}
	println(s)
	//fmt.Printf("diffs: %v\n", diffs)
	//fmt.Println("===========")
	//fmt.Println(dmp.DiffPrettyText(diffs))
	//fmt.Println("===========")
	//fmt.Println(dmp.DiffPrettyHtml(diffs))
	return
}
